In [7]:
import pandas as pd
df=pd.read_csv("E:/s1.csv")
df

   Student id    Name Department
0        s001     Anu        CSE
1        s002    Ravi        ECE
2        s003   Meena        CSE
3        s004  Kirana       MECH

In [12]:
import pandas as pd
df1=pd.read_csv("E:/s2.csv")
df1

  student_id  math_marks  science_ marks
0       s001          85              78
1       s002          90              88
2       s003          75              82
3       s005          80              79

In [13]:
df_merged=pd.merge(df,df1,on='student_id',how='inner')

In [14]:
df_merged

  student_id  math_marks_x  science_ marks_x  math_marks_y  science_ marks_y
0       s001            85                78            85                78
1       s002            90                88            90                88
2       s003            75                82            75                82
3       s005            80                79            80                79